tutorial/softwood/spruce(Grønli2002)/5K/CRECK2018/0/save/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "90";
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    WALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-9.819132231e-06
-9.838153015e-06
-9.869496717e-06
-9.909162013e-06
-9.952219734e-06
-9.993885691e-06
-1.003039052e-05
-1.00595306e-05
...
)
;
    }
    INLET
    {
        type            calculated;
        value           uniform -0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform -0;
    }
}


// ************************************************************************* //
