tutorial/softwood/spruce(Grønli2002)/5K/CRECK2018/0/weightedK_
273 1.85737e-09
423 6.00891e-06
423.025 6.01914e-06
423.05 6.02938e-06
423.075 6.03914e-06
423.083 6.04305e-06
423.108 6.05331e-06
423.133 6.06359e-06
423.158 6.0734e-06
423.167 6.07732e-06
423.192 6.08763e-06
423.217 6.09796e-06
423.242 6.10781e-06
423.25 6.11174e-06
423.275 6.12209e-06
423.3 6.13246e-06
423.325 6.14236e-06
423.333 6.1463e-06
423.358 6.1567e-06
423.383 6.1671e-06
423.408 6.17706e-06
423.417 6.181e-06
423.442 6.19144e-06
423.467 6.2019e-06
423.492 6.2119e-06
423.5 6.21586e-06
423.525 6.22634e-06
423.55 6.23684e-06
423.575 6.24689e-06
423.583 6.25085e-06
423.608 6.26138e-06
423.633 6.27192e-06
423.658 6.28203e-06
423.667 6.286e-06
423.692 6.29657e-06
423.717 6.30716e-06
423.742 6.31731e-06
423.75 6.3213e-06
423.775 6.33192e-06
423.8 6.34255e-06
423.825 6.35275e-06
423.833 6.35675e-06
423.858 6.36741e-06
423.883 6.37809e-06
423.908 6.38834e-06
423.917 6.39235e-06
423.942 6.40306e-06
423.967 6.41378e-06
423.992 6.42409e-06
424 6.4281e-06
424.025 6.43886e-06
424.05 6.44963e-06
424.075 6.45999e-06
424.083 6.46401e-06
424.108 6.47482e-06
424.133 6.48563e-06
424.158 6.49604e-06
424.167 6.50008e-06
424.192 6.51093e-06
424.217 6.5218e-06
424.242 6.53226e-06
424.25 6.53631e-06
424.275 6.5472e-06
424.3 6.55812e-06
424.325 6.56863e-06
424.333 6.57269e-06
424.358 6.58364e-06
424.383 6.5946e-06
424.408 6.60517e-06
424.417 6.60924e-06
424.442 6.62023e-06
424.467 6.63124e-06
424.492 6.64186e-06
424.5 6.64594e-06
424.525 6.65699e-06
424.55 6.66804e-06
424.575 6.67872e-06
424.583 6.68281e-06
424.608 6.69391e-06
424.633 6.70501e-06
424.658 6.71574e-06
424.667 6.71985e-06
424.692 6.73099e-06
424.717 6.74215e-06
424.742 6.75293e-06
424.75 6.75705e-06
424.775 6.76824e-06
424.8 6.77945e-06
424.825 6.79029e-06
424.833 6.79442e-06
424.858 6.80566e-06
424.883 6.81692e-06
424.908 6.82781e-06
424.917 6.83196e-06
424.942 6.84325e-06
424.967 6.85456e-06
424.992 6.86551e-06
425 6.86966e-06
425.025 6.88101e-06
425.05 6.89237e-06
...
723.05 0.000104902
